Revit 2026 API

# SubelementGetGeometryObject Method

---

Retrieve one geometric primitive representing given subelement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public GeometryObject GetGeometryObject(
	View dbView
)
```
```vb
Public Function GetGeometryObject (
	dbView As View
) As GeometryObject
```
```cpp
public:
GeometryObject^ GetGeometryObject(
	View^ dbView
)
```
```fsharp
member GetGeometryObject :
        dbView : View -> GeometryObject
```

#### Parameters

dbView View
     The view for view-specific geometry or  for model geometry.

#### Return Value

GeometryObject The geometric object representing this subelement.

In case of whole element, geometric object representing element and its subelements will be returned.  will be returned if related geometric object could not be found in the model.

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace